Revit 2027 API
BuiltInFailures.ToposolidBooleanPerturbationFailures.NonPerturbationBooleanFailed Property
 Boolean operation failed without perturbation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonPerturbationBooleanFailed { get; }
Public Shared ReadOnly Property NonPerturbationBooleanFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonPerturbationBooleanFailed {
	FailureDefinitionId^ get ();
}
static member NonPerturbationBooleanFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ToposolidBooleanPerturbationFailures Class
Autodesk.Revit.DB Namespace